/*-----------------------------------------------------------------------------------------------------------------------------------------------------------
SQL : ตรวจสอบจำนวนข้อมูลที่ค้นหา
Description : 
------------------------------------------------------------------------------------------------------------------------------------------------------------*/
countProduct {
	SELECT COUNT(1) AS TOT
	FROM PRODUCT
	WHERE TYPE_ID = %s
}
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------
SQL : ค้นหาข้อมูลสินค้าตามประเภท
Description : 
------------------------------------------------------------------------------------------------------------------------------------------------------------*/
searchById {
	SELECT ID
	,CODE
	,PRODUCT_DESC
	,PRICE
	,STOCK_NUM
	, CONCAT(IMAGE_NAME) AS IMAGE 
	, TYPE_ID
	FROM PRODUCT
	WHERE 1=1
	AND TYPE_ID = %s
	LIMIT 0 , 4
}

	/*-----------------------------------------------------------------------------------------------------------------------------------------------------------
SQL : ค้นหาสินค้า
Description : 
------------------------------------------------------------------------------------------------------------------------------------------------------------*/
searchOrder {
	SELECT O.ID
	 , O.NO
	 , O.ORDER_DATE
	 , O.TOTAL_PRICE
	 , O.TRACKING_NO
	 , O.SHIP
	 , O.SHIP_DATE
	 , U.USER_ID
	 , U.FIRST_NAME
	 , U.LAST_NAME
	 FROM ORDER_MAIN O INNER JOIN USER U ON O.USER_ID = U.USER_ID
	 WHERE 1=1
	 AND O.NO = %s
	 AND O.SHIP = %s
	 LIMIT 0
		, 10
}

/*-----------------------------------------------------------------------------------------------------------------------------------------------------------
SQL : ดูรายการชื้อ
Description : 
------------------------------------------------------------------------------------------------------------------------------------------------------------*/
viewById {
	SELECT o.ID
	, o.NO
	, o.ORDER_DATE
	, o.SHIP
	, o.SHIP_DATE
	, o.TRACKING_NO
	, o.NOTE
	, u.USER_ID
	, CONCAT(FIRST_NAME , '    ' , LAST_NAME) AS FULLNAME
	, u.FIRST_NAME
	, u.LAST_NAME
	, p.CODE
	, p.PRODUCT_DESC
	, d.TOTAL_NUM
	, d.TOTAL_PRICE
	FROM ORDER_MAIN o INNER JOIN USER u ON o.USER_ID = u.USER_ID
	INNER JOIN ORDER_DETAIL d ON d.ORDER_ID = o.ID
	INNER JOIN PRODUCT p ON p.ID = d.PRODUCT_ID
	
}

/*-----------------------------------------------------------------------------------------------------------------------------------------------------------
SQL : ค้นหาข้อมูลสินค้าในตะกร้า
Description : 
------------------------------------------------------------------------------------------------------------------------------------------------------------*/
searchByIdChart {
	SELECT o.ID
	, o.TOTAL_NUM
	, o.TOTAL_PRICE
	, p.CODE
	, p.IMAGE_NAME
	, p.PRODUCT_DESC
	, p.PRICE
	, p.TYPE_ID
	FROM ORDER_DETAIL o INNER JOIN PRODUCT p ON o.PRODUCT_ID = p.ID
	WHERE 1=1
	AND o.ACTIVE = 'Y'
	AND o.ORDER_ID = %s
}
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------
SQL : ลบสิรค้าในตะกร้า
Description : 
------------------------------------------------------------------------------------------------------------------------------------------------------------*/

deleteChart {
	UPDATE ORDER_DETAIL SET
   ACTIVE = 'N'
 WHERE PRODUCT_ID IN (%s)
}

/*-----------------------------------------------------------------------------------------------------------------------------------------------------------
SQL : เพิ่มสินค้าในตะกร้า
Description : 
------------------------------------------------------------------------------------------------------------------------------------------------------------*/
insertChart {
	INSERT INTO ORDER_DETAIL(
		PRODUCT_ID
		, TOTAL_NUM
		, TOTAL_PRICE
		, ORDER_ID
		, ACTIVE
	) VALUES (
		%s
		, %s
		, %s
		, %s
		, 'Y'
	)
}



/*-----------------------------------------------------------------------------------------------------------------------------------------------------------
SQL : ค้าหา id ของสินค้า
Description : 
------------------------------------------------------------------------------------------------------------------------------------------------------------*/

searchIdProduct {	
		SELECT ID
		, CODE
		, PRODUCT_DESC
		, PRICE
		, STOCK_NUM
		, CONCAT(IMAGE_NAME) AS IMAGE 
		, TYPE_ID
		FROM PRODUCT
		WHERE 1=1
		AND CODE = %s
}